update readme system diagram
